CREATE TABLE books
(name VARCHAR(50),
`sequence` INT,
`buy-time` TIMESTAMP,
desc VARCHAR(5000)
);

--;;

insert into books (name, `sequence`, `buy-time`, desc) values
('黑客与画家',1, '2018-08-01', '本书是硅谷创业之父Paul Graham 的文集'),
('黑客与画家',2, '2018-08-01', '本书是硅谷创业之父Paul Graham 的文集'),
('黑客与画家',3, '2018-08-01', '本书是硅谷创业之父Paul Graham 的文集'),
(' Clojure编程乐趣(第2版) ',1, '2018-08-01', '本书通过对Clojure详尽地探究，讲述函数式的程序设计方式，帮助读者理解和体会Clojure编程的乐趣，进而开发出优美的软件。'),
(' Clojure编程乐趣(第2版) ',2, '2018-08-01', '本书通过对Clojure详尽地探究，讲述函数式的程序设计方式，帮助读者理解和体会Clojure编程的乐趣，进而开发出优美的软件。'),
('Clojure高级编程',1, '2018-08-01', '本书首先介绍函数式编程基础知识,此后重点讲解与Clojure相关的特定主题'),
('Clojure高级编程',2, '2018-08-01', '本书首先介绍函数式编程基础知识,此后重点讲解与Clojure相关的特定主题'),
('Clojure经典实例',1, '2018-08-01', '本书以具体实例的形式讲解了Clojure语言在不同领域的应用'),
('Clojure经典实例',2, '2018-08-01', '本书以具体实例的形式讲解了Clojure语言在不同领域的应用'),
('计算机程序的构造和解释（原书第2版）',1, '2018-08-01', '1984年出版，成型于美国麻省理工学院(MIT)多年使用的一本教材，1996年修订为第2版。在过去的二十多年里，《计算机程序的构造和解释(原书第2版)》对于计算机科学的教育计划产生了深刻的影响'),
('计算机程序的构造和解释（原书第2版）',2, '2018-08-01', '1984年出版，成型于美国麻省理工学院(MIT)多年使用的一本教材，1996年修订为第2版。在过去的二十多年里，《计算机程序的构造和解释(原书第2版)》对于计算机科学的教育计划产生了深刻的影响'),
('自私的基因',1, '2018-08-01', '我们从哪里来，又将到哪里去？生命有何意义，我们该如何认识自己？《自私的基因》以充满想象力的叙述回答了这些重要命题。道金斯在本书中提出大胆创见：我们生来是自私的，任何生物，包括我们自己，都只是求生的机器。这本书是实实在在的认知科学，复制、变异和淘汰这简单的三种机制可以演变出大千世界所有生命现象的林林总总。'),
('盲眼钟表匠',1, '2018-08-01', '这是英国著名生物学家、《自私的基因》的作者道金斯又一本经典之作。本书是正宗的演化论入门书，是我们认识自己，认识生命本身的绝佳读本'),
('上帝的错觉',1, '2018-08-01', '以科学人文观剖析了宗教的由来及对人类思想的禁锢和欺骗，道金斯因本书颠覆性的观念被西方宗教人士称为撒旦的化身。本书的价值在于引导我们理性认识宗教。'),
('地球上伟大的表演：进化的证据',16, '2018-08-01', '英国著名生物学家道金斯的又一本经典之作'),
('魔鬼的牧师',1, '2018-08-01', '英国著名生物学家道金斯的又一本经典之作'),
('解析彩虹',1, '2018-08-01', '英国著名生物学家道金斯的又一本经典之作'),
('旅行的艺术',1, '2018-08-01', '阿兰德波顿的又一本经典之作'),
('身份的焦虑',1, '2018-08-01', '阿兰德波顿的又一本经典之作'),
('拥抱逝水年华',1, '2018-08-01', '阿兰德波顿的又一本经典之作'),
('幸福的建筑',1, '2018-08-01', '阿兰德波顿的又一本经典之作'),
('亲吻与诉说',1, '2018-08-01', '阿兰德波顿的又一本经典之作'),
('工作颂歌',1, '2018-08-01', '阿兰德波顿的又一本经典之作'),
('哲学的慰藉',1, '2018-08-01', '阿兰德波顿的又一本经典之作'),
('写给无神论者',1, '2018-08-01', '阿兰德波顿的又一本经典之作'),
('机场里的小旅行',1, '2018-08-01', '阿兰德波顿的又一本经典之作'),
('无聊的魅力',1, '2018-08-01', '阿兰德波顿的又一本经典之作')
;

--;;
create table users
(name varchar(50),
 password varchar(50)
);

--;;

insert into users(name, password) values
('kevin', 'kevin');

--;;

create table history
(`book-id` int,
 `borrower-name` varchar(50),
 `start-time` timestamp,
 `end-time` timestamp,
 `returned` boolean,
 comments text);


--;;

insert into history (`book-id`,`borrower-name`, `start-time`, `end-time`,`returned`, comments) values
(1, 'Kevin', '2018-08-01', '2018-08-04', true, "好书..."),
(2, 'Kevin', '2018-08-01', '2018-08-04', true, "好书..."),
(3, 'Kevin', '2018-08-01', '2018-08-04', true, "好书..."),
(4, 'Kevin', '2018-08-01', '2018-08-04', true, "好书..."),
(5, 'Kevin', '2018-08-01', '2018-08-04', true, "好书..."),
(6, 'Kevin', '2018-08-01', '2018-08-04', true, "好书..."),
(7, 'Kevin', '2018-08-01', '2018-08-04', true, "好书..."),
(8, 'Kevin', '2018-08-01', '2018-08-04', true, "好书..."),
(9, 'Kevin', '2018-08-01', '2018-08-04', true, "好书..."),
(10, 'Kevin', '2018-08-01', '2018-08-04', true, "好书..."),
(11, 'Kevin', '2018-08-01', '2018-08-04', true, "好书..."),
(12, 'Kevin', '2018-08-01', '2018-08-04', true, "好书..."),
(13, 'Kevin', '2018-08-01', '2018-08-04', true, "好书..."),
(14, 'Kevin', '2018-08-01', '2018-08-04', true, "好书..."),
(15, 'Kevin', '2018-08-01', '2018-08-04', true, "好书..."),
(16, 'Kevin', '2018-08-01', '2018-08-04', true, "好书..."),
(17, 'Kevin', '2018-08-01', '2018-08-04', true, "好书..."),
(18, 'Kevin', '2018-08-01', '2018-08-04', true, "好书..."),
(19, 'Kevin', '2018-08-01', '2018-08-04', true, "好书..."),
(20, 'Kevin', '2018-08-01', '2018-08-04', true, "好书..."),
(21, 'Kevin', '2018-08-01', '2018-08-04', true, "好书..."),
(22, 'Kevin', '2018-08-01', '2018-08-04', true, "好书..."),
(23, 'Kevin', '2018-08-01', '2018-08-04', true, "好书..."),
(24, 'Kevin', '2018-08-01', '2018-08-04', true, "好书..."),
(25, 'Kevin', '2018-08-01', '2018-08-04', true, "好书..."),
(26, 'Kevin', '2018-08-01', '2018-08-04', true, "好书..."),
(27, 'Kevin', '2018-08-01', '2018-08-04', true, "好书...")
;
